Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Для Каждого СтрокаТовара Из Товары Цикл
        Если Не ЗначениеЗаполнено(СтрокаТовара.Товар) Или СтрокаТовара.Количество <= 0 Тогда
            Отказ = Истина;
            Возврат;
        КонецЕсли;
    КонецЦикла;
    Движения.ОстаткиТоваров.Записывать = Истина;
    Для Каждого СтрокаТовара Из Товары Цикл
        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
        Движение.Товар = СтрокаТовара.Товар;
        Движение.Количество = СтрокаТовара.Количество;
    КонецЦикла;
КонецПроцедуры
